# IsFooterSectionHidden Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..IsFooterSectionHidden Property
PanelScheduleData Class See Also
---
True if the user wishes to hide the footer section; setting this value must go through the appropriate update function
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsFooterSectionHidden { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsFooterSectionHidden As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsFooterSectionHidden {
	bool get ();
}
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace